Tekla Open API Reference for Tekla Structures 2025
Boolean.Father Property
 The father object of the boolean operation; the model object instance to operate on.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ModelObject Father { get; set; }
Public Property Father As ModelObject
	Get
	Set
Property Value
Type: ModelObject
See Also
Reference
Boolean Class
Tekla.Structures.Model Namespace